{
    "aws:RequestTag/${TagKey}": {
        "condition": "aws:RequestTag/${TagKey}",
        "description": "Filters access based on the tags that are passed in the request when creating or tagging a resource share. If users don't pass these specific tags, or if they don't specify tags at all, the request fails",
        "type": "String"
    },
    "aws:ResourceTag/${TagKey}": {
        "condition": "aws:ResourceTag/${TagKey}",
        "description": "Filters access based on the tags associated with the resource",
        "type": "String"
    },
    "aws:TagKeys": {
        "condition": "aws:TagKeys",
        "description": "Filters access based on the tag keys that are passed when creating or tagging a resource share",
        "type": "ArrayOfString"
    },
    "ram:AllowsExternalPrincipals": {
        "condition": "ram:AllowsExternalPrincipals",
        "description": "Filters access based on resource shares that allow or deny sharing with external principals. For example, specify true if the action can only be performed on resource shares that allow sharing with external principals. External principals are AWS accounts that are outside of its AWS organization",
        "type": "Bool"
    },
    "ram:PermissionArn": {
        "condition": "ram:PermissionArn",
        "description": "Filters access based on the specified Permission ARN",
        "type": "ARN"
    },
    "ram:PermissionResourceType": {
        "condition": "ram:PermissionResourceType",
        "description": "Filters access based on permissions of specified resource type",
        "type": "String"
    },
    "ram:Principal": {
        "condition": "ram:Principal",
        "description": "Filters access based on the format of the specified principal",
        "type": "String"
    },
    "ram:RequestedAllowsExternalPrincipals": {
        "condition": "ram:RequestedAllowsExternalPrincipals",
        "description": "Filters access based on the specified value for 'allowExternalPrincipals'. External principals are AWS accounts that are outside of its AWS Organization",
        "type": "Bool"
    },
    "ram:RequestedResourceType": {
        "condition": "ram:RequestedResourceType",
        "description": "Filters access based on the specified resource type",
        "type": "String"
    },
    "ram:ResourceArn": {
        "condition": "ram:ResourceArn",
        "description": "Filters access based on a resource with the specified ARN",
        "type": "ARN"
    },
    "ram:ResourceShareName": {
        "condition": "ram:ResourceShareName",
        "description": "Filters access based on a resource share with the specified name",
        "type": "String"
    },
    "ram:ShareOwnerAccountId": {
        "condition": "ram:ShareOwnerAccountId",
        "description": "Filters access based on resource shares owned by a specific account. For example, you can use this condition key to specify which resource share invitations can be accepted or rejected based on the resource share owner's account ID",
        "type": "String"
    }
}